{
  "Title": "Change a Major/Minor Field",
  "SubmitInfo": "After submitting this request, it will be routed to our administration department for further proccessing.",
  "FirstName": "First Name",
  "LastName": "Last Name",
  "Email": "Email",
  "MinorField": "Minor Field",
  "MajorField": "Major Field",
  "SubmitButton": "Request for Field Change",
  "SubmitButtonClicked": "Requesting...",
  "Courses": ["Art", "Psychology", "Computer Science", "World History", "Philosophy", "Education", "Biology", "Physics", "Chemistry", "Sociology", "Architecture", "Archeology", "Environmental Studies", "Political Science", "Engineering", "English", "Mathematics", "Statistics", "Theology", "Business"],
  "Error": {
    "FirstName": "First Name is required.",
    "LastName": "Last Name is required.",
    "Email": "Email is required.",
    "MinorField": "Please select a field to change.",
    "MajorField": "Please select a field to change."
  },
  "ApiDecription": {
    "SeeMore": "- See behind the scenes",
    "CodeFlow": "<h4>This Sample Features:</h4> <ul><li>Update recipient information</li></ul> <li>Create envelope from HTML Import</li> <li>Fill tab data</li> <li>Embedded Signing (Recipient View)</li></ul> <h4>Code Flow:</h4> <h5>Step 1</h5> <p>When the form is submitted we use the Envelopes: create method to send the signature request with the corresponding form information. The envelope we construct contains various data, specifically a document object, a recipient object with the type signer, and tabs objects which contain form field information. Since we are using embedded signing, we must also set the clientUserId property on the recipient.</p> <p>We place the tabs on the document by specifying a SignHereTab element and an InitialTab element as part of the signer element. The tab elements are positioned using x/y coordinates on the document.</p> <p>Lastly, we include the status “sent” in the request so that the envelope is sent for signing.</p> <p>The eSignature API POST request is sent to the following URL:</p> <p>POST /v2.1/accounts/{accountId}/envelopes</p> <h5>Step 2</h5> <p>To enable embedded signing of the envelope inside our application ,we next use the EnvelopeViews: createRecipient method to generate a signing URL for the recipient. For this to work the clientUserId property must be set on the recipient when the envelope was sent during step 1 above.</p> <p>Once the envelope is sent we save the envelope ID and Recipient information to our session. Then, we retrieve the envelope ID and recipient info from our session and create the recipient view by generating the URL and displaying in a full-width and full-height iframe inside our page.</p> <p>To create the recipient view of the envelope we send an http POST request to:</p> <p>POST /v2.1/accounts/{accountId}/envelopes/{envelopeId}/views/recipient</p>"
  }
}
